olliw42/stm32ll-lib/src/stdstm32-uartb.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTB_USE_UART1, UARTB_USE_UART2, UARTB_USE_UART3, UARTB_USE_UART3_REMAPPED, UARTB_USE_UART4, UARTB_USE_UART5
// #define UARTB_USE_LPUART1, UARTB_USE_LPUART1_REMAPPED
//
// #define UARTB_BAUD
//
// #define UARTB_USE_TX
// #define UARTB_TXBUFSIZE
// #define UARTB_USE_TX_ISR
// #define UARTB_USE_TX_DMA
//
// #define UARTB_USE_RX
// #define UARTB_RXBUFSIZE
//
// #define UARTB_IRQ_PRIORITY
//
// #define UARTB_USE_RXERRORCOUNT
//
// #define UARTB_RX_CALLBACK_FULL(c)
// #define UARTB_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTB_H
#define STDSTM32_UARTB_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART!
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART!
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTB_USE_TX_ISR) && (!defined UARTB_USE_TX)
  #error UARTB_USE_TX_ISR used without UARTB_USE_TX!
#endif
#if (defined UARTB_USE_RXERRORCOUNT) && (!defined UARTB_USE_RX)
  #error UARTB_USE_RXERRORCOUNT used without UARTB_USE_RX!
#endif

#ifdef UARTB_USE_TX_DMA
  #error UARTB_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTB_BAUD
  #define UARTB_BAUD             115200UL // 9600UL
#endif


#ifdef UARTB_USE_TX_ISR
  #ifndef UARTB_TXBUFSIZE
    #define UARTB_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTB_TXBUFSIZE < 2
    #error UARTB_TXBUFSIZE must be larger than 1 !
  #elif ((UARTB_TXBUFSIZE & (UARTB_TXBUFSIZE-1)) != 0)
    #error UARTB_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_TXBUFSIZEMASK  (UARTB_TXBUFSIZE-1)

  volatile char uartb_txbuf[UARTB_TXBUFSIZE];
  volatile uint16_t uartb_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTB_USE_RX
  #ifndef UARTB_RXBUFSIZE
    #define UARTB_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTB_RXBUFSIZE < 2
    #error UARTB_RXBUFSIZE must be larger than 1 !
  #elif ((UARTB_RXBUFSIZE & (UARTB_RXBUFSIZE-1)) != 0)
    #error UARTB_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_RXBUFSIZEMASK  (UARTB_RXBUFSIZE-1)

  volatile char uartb_rxbuf[UARTB_RXBUFSIZE];
  volatile uint16_t uartb_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTB_USE_RXERRORCOUNT
  volatile uint32_t uartb_errorcnt_rxnoise;
  volatile uint32_t uartb_errorcnt_rxframe;
  volatile uint32_t uartb_errorcnt_rxoverrun;
  #endif
#endif


#if defined UARTB_USE_UART1 || defined UARTB_USE_UART1_REMAPPED || defined UARTB_USE_UART1_REMAPPED2
  #define UARTB_UARTx             USART1
  #ifdef UARTB_USE_UART1
    #define UARTB_TX_IO           IO_PA9
    #define UARTB_RX_IO           IO_PA10
  #elif defined UARTB_USE_UART1_REMAPPED
    #define UARTB_TX_IO           IO_PB6
    #define UARTB_RX_IO           IO_PB7
  #elif defined UARTB_USE_UART1_REMAPPED2 // only G4
    #define UARTB_TX_IO           IO_PC4 // on G4
    #define UARTB_RX_IO           IO_PC5
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART1_IRQn
  #define UARTB_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTB_USE_UART2 || defined UARTB_USE_UART2_REMAPPED || defined UARTB_USE_UART2_REMAPPED2 || defined UARTB_USE_UART2_REMAPPED3
  #define UARTB_UARTx             USART2
  #ifdef UARTB_USE_UART2
    #define UARTB_TX_IO           IO_PA2
    #define UARTB_RX_IO           IO_PA3
  #elif defined UARTB_USE_UART2_REMAPPED
    #define UARTB_TX_IO           IO_PD5
    #define UARTB_RX_IO           IO_PD6
  #elif defined UARTB_USE_UART2_REMAPPED2 // only G4
    #define UARTB_TX_IO           IO_PB3
    #define UARTB_RX_IO           IO_PB4
  #elif defined UARTB_USE_UART2_REMAPPED3 // only G4 // ATTENTION: PA14 overlaps with SWCLK
    #define UARTB_TX_IO           IO_PA14
    #define UARTB_RX_IO           IO_PA15
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART2_IRQn
  #define UARTB_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTB_USE_UART3 || defined UARTB_USE_UART3_REMAPPED
  #define UARTB_UARTx             USART3
  #if defined UARTB_USE_UART3 && defined STM32F3
    #define UARTB_TX_IO           IO_PB8
    #define UARTB_RX_IO           IO_PB9
  #elif defined UARTB_USE_UART3
    #define UARTB_TX_IO           IO_PB10
    #define UARTB_RX_IO           IO_PB11
  #else
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART3_IRQn
  #define UARTB_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART4 || defined UARTB_USE_UART4_REMAPPED
  #define UARTB_UARTx             UART4
  #ifdef UARTB_USE_UART4
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #else
    #define UARTB_TX_IO           IO_PA0 // only F7 !
    #define UARTB_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #endif
  #define UARTB_IRQn              UART4_IRQn
  #define UARTB_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART5
  #define UARTB_UARTx             UART5
  #define UARTB_TX_IO             IO_PC12
  #define UARTB_RX_IO             IO_PD2
  #define UARTB_IRQn              UART5_IRQn
  #define UARTB_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

