olliw42/stm32ll-lib/src/stdstm32-uartb.h
#ifdef UARTB_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTB_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
  // Flush buffer
  uartb_rxwritepos = uartb_rxreadpos = 0;
#ifdef UARTB_USE_RXERRORCOUNT
  uartb_errorcnt_rxnoise = 0;
  uartb_errorcnt_rxframe = 0;
  uartb_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTB_UARTx->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  CLEAR_BIT(UARTB_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN));

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTB_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTB_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTB_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTB_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTB_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32WL
#if !defined UARTB_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTB_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UARTB_UARTx);

#if defined STM32G4 || defined STM32WL
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTB_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTB_UARTx)))) {};
#endif
}


void uartb_init(void)
{
  uartb_init_isroff();
  uartb_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTB_H
